docs/final/testing/k6/load-products-summary.txt
     ✓ status is 200
     ✓ body is JSON array/page

   ✓ checks.........................: 100.00% ✓ 2048     ✗ 0   
     data_received..................: 6.6 MB  60 kB/s
     data_sent......................: 1.3 MB  11 kB/s
     http_req_blocked...............: avg=86.92µs  min=2.7µs  med=16.12µs  max=6.8ms   p(90)=34.27µs  p(95)=57.47µs 
     http_req_connecting............: avg=55.02µs  min=0s     med=0s       max=4.89ms  p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=9.2ms    min=2.85ms med=8.76ms   max=67.81ms p(90)=12.97ms  p(95)=15.31ms 
       { expected_response:true }...: avg=9.2ms    min=2.85ms med=8.76ms   max=67.81ms p(90)=12.97ms  p(95)=15.31ms 
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 1025
     http_req_receiving.............: avg=156.88µs min=28.7µs med=118.79µs max=4.59ms  p(90)=240.95µs p(95)=313.28µs
     http_req_sending...............: avg=64.18µs  min=6.25µs med=47.5µs   max=2.1ms   p(90)=100.02µs p(95)=145.14µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=8.98ms   min=2.78ms med=8.57ms   max=67.03ms p(90)=12.63ms  p(95)=14.91ms 
     http_reqs......................: 1025    9.278542/s
     iteration_duration.............: avg=1.01s    min=1s     med=1.01s    max=1.07s   p(90)=1.01s    p(95)=1.02s   
     iterations.....................: 1024    9.26949/s
     vus............................: 1       min=0      max=15
     vus_max........................: 15      min=15     max=15