docs/final/testing/k6/load-products-summary.txt
     ✓ status is 200
     ✓ body is JSON array/page

   ✓ checks.........................: 100.00% ✓ 2046     ✗ 0   
     data_received..................: 6.7 MB  60 kB/s
     data_sent......................: 1.3 MB  11 kB/s
     http_req_blocked...............: avg=101.67µs min=2.16µs med=16.81µs  max=11.06ms  p(90)=42.97µs  p(95)=66.43µs 
     http_req_connecting............: avg=50.25µs  min=0s     med=0s       max=6.58ms   p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=12.18ms  min=3.06ms med=10.35ms  max=164.01ms p(90)=17.2ms   p(95)=23.91ms 
       { expected_response:true }...: avg=12.18ms  min=3.06ms med=10.35ms  max=164.01ms p(90)=17.2ms   p(95)=23.91ms 
   ✓ http_req_failed................: 0.00%   ✓ 0        ✗ 1024
     http_req_receiving.............: avg=198.72µs min=18µs   med=120.83µs max=12.87ms  p(90)=267.14µs p(95)=355.42µs
     http_req_sending...............: avg=73.29µs  min=5.91µs med=52.06µs  max=2.48ms   p(90)=122.79µs p(95)=186.07µs
     http_req_tls_handshaking.......: avg=0s       min=0s     med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=11.9ms   min=2.98ms med=10.11ms  max=163.45ms p(90)=16.81ms  p(95)=23.69ms 
     http_reqs......................: 1024    9.246688/s
     iteration_duration.............: avg=1.01s    min=1s     med=1.01s    max=1.18s    p(90)=1.02s    p(95)=1.03s   
     iterations.....................: 1023    9.237658/s
     vus............................: 1       min=0      max=15
     vus_max........................: 15      min=15     max=15