docs/final/testing/k6/stress-products-summary.txt
     ✗ status is 200
      ↳  99% — ✓ 17218 / ✗ 1

   ✓ checks.........................: 99.99% ✓ 17218      ✗ 1    
     data_received..................: 273 MB 2.4 MB/s
     data_sent......................: 21 MB  184 kB/s
     http_req_blocked...............: avg=71.77µs  min=0s       med=5.54µs   max=62.94ms  p(90)=17.33µs  p(95)=31.66µs 
     http_req_connecting............: avg=45µs     min=0s       med=0s       max=58.76ms  p(90)=0s       p(95)=0s      
   ✓ http_req_duration..............: avg=17.34ms  min=0s       med=7.62ms   max=1.12s    p(90)=26.27ms  p(95)=40.86ms 
       { expected_response:true }...: avg=17.34ms  min=1.91ms   med=7.62ms   max=1.12s    p(90)=26.27ms  p(95)=40.87ms 
   ✓ http_req_failed................: 0.00%  ✓ 1          ✗ 17219
     http_req_receiving.............: avg=1.15ms   min=0s       med=371.83µs max=566.96ms p(90)=1.89ms   p(95)=3.2ms   
     http_req_sending...............: avg=81.4µs   min=0s       med=16.91µs  max=199.43ms p(90)=55.42µs  p(95)=106.3µs 
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       max=0s       p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=16.1ms   min=0s       med=6.99ms   max=1.11s    p(90)=24.26ms  p(95)=38.66ms 
     http_reqs......................: 17220  149.593262/s
     iteration_duration.............: avg=321.39ms min=302.32ms med=309.19ms max=30.32s   p(90)=328.83ms p(95)=345.08ms
     iterations.....................: 17219  149.584575/s
     vus............................: 1      min=1        max=80 
     vus_max........................: 80     min=80       max=80